In [1]:
import pandas as pd 
import numpy as np

In [2]:
csv_file = './A_product_sales.csv'

In [3]:
print(csv_file)

./A_product_sales.csv

In [4]:
type (csv_file)

str

In [7]:
df = pd.read_csv(csv_file, encoding = "utf-8")

In [8]:
print(df)

     연도   1분기   2분기   3분기   4분기
0  2016  2412  4032  5183  1139
1  2017  2725  4986  6015  1242
2  2018  2925  5286  6497  1596
3  2019  2691  5813  7202  1358
4  2020  2523  6137  7497  1512

In [9]:
df[:]

     연도   1분기   2분기   3분기   4분기
0  2016  2412  4032  5183  1139
1  2017  2725  4986  6015  1242
2  2018  2925  5286  6497  1596
3  2019  2691  5813  7202  1358
4  2020  2523  6137  7497  1512

In [13]:
ex = df["1분기"]

In [30]:
df["1분기"][:]

0    2412
1    2725
2    2925
3    2691
4    2523
Name: 1분기, dtype: int64

In [31]:
#Excel file Reading

excel_file = "./CES마켓_주문내역.xlsx"

In [32]:
df = pd.read_excel(excel_file)

In [33]:
print(df)

     주문번호 주문지역       주문일자  제품유형        고객ID 고객등급
0  351291   서울 2022-07-04    의류  EeNMuRpdzG    A
1  351292   경기 2022-07-05   컴퓨터  H7o4KJizTE    B
2  351293   강원 2022-07-06   식료품  OEA4cDdkyg    A
3  351294   호남 2022-07-07  주방제품  GGe6nkrlnV    C
4  351295   영남 2022-07-08    여행    jTrJPdZA    B
5  351296   충청 2022-07-09    도서   Fjs00aZuo    C

In [34]:
df = pd.read_excel(excel_file,index_col='주문번호')

In [35]:
print (df)

       주문지역       주문일자  제품유형        고객ID 고객등급
주문번호
351291   서울 2022-07-04    의류  EeNMuRpdzG    A
351292   경기 2022-07-05   컴퓨터  H7o4KJizTE    B
351293   강원 2022-07-06   식료품  OEA4cDdkyg    A
351294   호남 2022-07-07  주방제품  GGe6nkrlnV    C
351295   영남 2022-07-08    여행    jTrJPdZA    B
351296   충청 2022-07-09    도서   Fjs00aZuo    C

In [36]:

index_data = ['a','b','c','d','e']
data = [0.0,1.0,2.0,3.0,4.0]
s1 = pd.Series(data,index = index_data)

In [37]:
print(s1)

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [38]:
s1.loc['a']

0.0

In [40]:
r = s1.loc[['a','c','e']]

In [42]:
print(r[2])

4.0

In [44]:
s1.loc[[1:2]]

SyntaxError: invalid syntax (1049753109.py, line 1)

In [47]:
s1.iloc[2:4]

c    2.0
d    3.0
dtype: float64

In [48]:
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [57]:
dict_data = {'Col_A': [0,10,20,30,40,50],"Col_B":[0.1,0.3,0.5,0.6,0.7,0.8], "Col_C":[0,100,200,300,400,500]}

In [59]:
index_data = ['row_a','row_b','row_c','row_d','row_e','row_f']

In [60]:
df1 = pd.DataFrame(dict_data, index = index_data)

In [61]:
print(df1)

       Col_A  Col_B  Col_C
row_a      0    0.1      0
row_b     10    0.3    100
row_c     20    0.5    200
row_d     30    0.6    300
row_e     40    0.7    400
row_f     50    0.8    500

In [63]:
df1.loc['row_a']

Col_A    0.0
Col_B    0.1
Col_C    0.0
Name: row_a, dtype: float64

In [65]:
r = df1["Col_B"]

In [85]:
print(df1.loc[["row_a","row_c"]])

       Col_A  Col_B  Col_C
row_a      0    0.1      0
row_c     20    0.5    200

In [92]:
df1[(df1>0.5) & (df1<1)]

       Col_A  Col_B  Col_C
row_a    NaN    NaN    NaN
row_b    NaN    NaN    NaN
row_c    NaN    NaN    NaN
row_d    NaN    0.6    NaN
row_e    NaN    0.7    NaN
row_f    NaN    0.8    NaN

In [93]:
# DataFrame 데이터 생성
dict_data = {'지점': ['서울', '대전', '대구', '부산', '광주'],
             '1월': [558, 234, 340, 380, 213],
             '2월': [437, 216, 238, 290, 194], 
             '3월': [337, 196, 209, 272, 186]} # 딕셔너리 데이터

df = pd.DataFrame(dict_data) # 딕셔너리 데이터로부터 DataFrame 데이터 생성
df

   지점   1월   2월   3월
0  서울  558  437  337
1  대전  234  216  196
2  대구  340  238  209
3  부산  380  290  272
4  광주  213  194  186

In [96]:
s= pd.Series(range(-3,6))

In [104]:
df[df['1월']>=300]

   지점   1월   2월   3월
0  서울  558  437  337
2  대구  340  238  209
3  부산  380  290  272

In [139]:
df[(df['지점'] =='서울')]

   지점   1월   2월   3월
0  서울  558  437  337

In [111]:
r = df[df['지점'].isin(['대구','부산'])]

In [112]:
type(r)

pandas.core.frame.DataFrame

In [116]:
r[['1월']]

    1월
2  340
3  380

In [128]:
df.loc[1]

지점     대전
1월    234
2월    216
3월    196
Name: 1, dtype: object

In [130]:
df.head(3)

   지점   1월   2월   3월
0  서울  558  437  337
1  대전  234  216  196
2  대구  340  238  209

In [134]:
df.loc[:]

   지점   1월   2월   3월
0  서울  558  437  337
1  대전  234  216  196
2  대구  340  238  209
3  부산  380  290  272
4  광주  213  194  186

In [137]:
df[df['지점']==("1월")]

Empty DataFrame
Columns: [지점, 1월, 2월, 3월]
Index: []

In [153]:
dict_data = { '제품ID':['P501', 'P502', 'P503', 'P504', 'P505', 'P506', 'P507'],
              '판매가격':[6400, 5400, 9400, 10400, 9800, 1200, 3400],
              '판매량':[63, 56, 98, 48, 72, 59, 43],
              '이익률':[0.30, 0.21, 0.15, 0.25, 0.45, 0.47, 0.32]}  # 딕셔너리 데이터

df2 = pd.DataFrame(dict_data)
df2

   제품ID   판매가격  판매량   이익률
0  P501   6400   63  0.30
1  P502   5400   56  0.21
2  P503   9400   98  0.15
3  P504  10400   48  0.25
4  P505   9800   72  0.45
5  P506   1200   59  0.47
6  P507   3400   43  0.32

In [154]:
r1= df2["판매가격"]

In [155]:
r2 = df2[["판매가격"]]

In [156]:
print("r1 : " , type(r1))
print("r2 : " , type(r2))

r1 :  <class 'pandas.core.series.Series'>
r2 :  <class 'pandas.core.frame.DataFrame'>

In [157]:
print(r1)

0     6400
1     5400
2     9400
3    10400
4     9800
5     1200
6     3400
Name: 판매가격, dtype: int64

In [158]:
print(r2)

    판매가격
0   6400
1   5400
2   9400
3  10400
4   9800
5   1200
6   3400

In [168]:
df2[(df2['판매가격'] >=5000) | (df2['이익률']>=0.34)]

   제품ID   판매가격  판매량   이익률
0  P501   6400   63  0.30
1  P502   5400   56  0.21
2  P503   9400   98  0.15
3  P504  10400   48  0.25
4  P505   9800   72  0.45
5  P506   1200   59  0.47

In [169]:
dict_data = {'A': [0, 1, 2, 3, 4],
             'B': [10, 11, 12, 13, 14],
             'C': [20, 21, 22, 23, 24]} # 딕셔너리 데이터

index_data = ['a', 'b', 'c', 'd', 'e'] # index 지정용 데이터

df = pd.DataFrame(dict_data, index=index_data) # DataFrame 데이터 생성
df

   A   B   C
a  0  10  20
b  1  11  21
c  2  12  22
d  3  13  23
e  4  14  24

In [171]:
df.loc['a','A']

0

In [179]:
df.loc['a':'c',['A','B']]

   A   B
a  0  10
b  1  11
c  2  12

In [177]:
df.loc[:,:]

   A   B   C
a  0  10  20
b  1  11  21
c  2  12  22
d  3  13  23
e  4  14  24

In [178]:
df.loc['a':'c',['A','B']]

   A   B
a  0  10
b  1  11
c  2  12

In [180]:
df.loc[:,['A','B']]

   A   B
a  0  10
b  1  11
c  2  12
d  3  13
e  4  14

In [182]:
df.iloc[:, 0:2]

   A   B
a  0  10
b  1  11
c  2  12
d  3  13
e  4  14

In [183]:
df.loc[df['A']>2, ['A','B']] #  조건

   A   B
d  3  13
e  4  14